; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_10 ?v10 ?v2)
             (pred_4 ?v3 ?v4)
             (pred_6 ?v10 ?v4)
             (pred_1 ?v1 ?v10 )
	     (pred_9 ?v10)
             (pred_12 ?v6)
             (pred_3 ?v3)
             (pred_5 ?v4)
             (pred_11 ?v10)
             (pred_8 ?v3)
             (pred_2 ?v10)
             (pred_7 ))



(:action op_1
:parameters (?v12 ?v5 ?v13 ?v8)
:precondition (and (pred_12 ?v12) (pred_12 ?v5) (pred_3 ?v13) (pred_5 ?v8)
          (pred_10 ?v12 ?v5) (pred_4 ?v13 ?v8)
                   (pred_6 ?v5 ?v8) (pred_9 ?v12) 
                   (pred_11 ?v5) (pred_8 ?v13))
:effect (and  (pred_2 ?v5) (not (pred_11 ?v5))))


(:action op_2
:parameters (?v12 ?v9)
:precondition (and (pred_12 ?v12) (pred_12 ?v9)
               (pred_9 ?v12) (pred_10 ?v12 ?v9) (pred_2 ?v9))
:effect (and (pred_9 ?v9) (not (pred_9 ?v12))))

(:action op_3
:parameters (?v12 ?v13)
:precondition (and (pred_12 ?v12) (pred_3 ?v13) 
                  (pred_9 ?v12) (pred_1 ?v13 ?v12) (pred_7 ))
:effect (and (pred_8 ?v13)
   (not (pred_1 ?v13 ?v12)) (not (pred_7 ))))


(:action op_4
:parameters (?v12 ?v11 ?v7)
:precondition (and (pred_12 ?v12) (pred_3 ?v11) (pred_3 ?v7)
                  (pred_9 ?v12) (pred_8 ?v7) (pred_1 ?v11 ?v12))
:effect (and (pred_8 ?v11) (pred_1 ?v7 ?v12)
        (not (pred_8 ?v7)) (not (pred_1 ?v11 ?v12))))

(:action op_5
:parameters (?v12 ?v13)
:precondition (and (pred_12 ?v12) (pred_3 ?v13) 
                  (pred_9 ?v12) (pred_8 ?v13))
:effect (and (pred_7 ) (pred_1 ?v13 ?v12) (not (pred_8 ?v13)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_14 obj_12 obj_15 obj_11 obj_17 obj_05 obj_19 obj_20 obj_02 obj_03 obj_18 obj_21 obj_08 obj_04 obj_22 obj_10
    obj_06 obj_01 obj_09
    obj_16 obj_13 obj_07
    )

    (:init
       (pred_7)

       (pred_12 obj_14)
       (pred_12 obj_12)
       (pred_12 obj_15)
       (pred_12 obj_11)
       (pred_12 obj_17)
       (pred_12 obj_05)
       (pred_12 obj_19)
       (pred_12 obj_20)
       (pred_12 obj_02)
       (pred_12 obj_03)
       (pred_12 obj_18)
       (pred_12 obj_21)
       (pred_12 obj_08)
       (pred_12 obj_04)
       (pred_12 obj_22)
       (pred_12 obj_10)
       (pred_5 obj_06)
       (pred_5 obj_01)
       (pred_5 obj_09)
       (pred_3 obj_16)
       (pred_3 obj_13)
       (pred_3 obj_07)

       (pred_10 obj_14 obj_17)
       (pred_10 obj_14 obj_12)
       (pred_10 obj_12 obj_05)
       (pred_10 obj_12 obj_15)
       (pred_10 obj_12 obj_14)
       (pred_10 obj_15 obj_19)
       (pred_10 obj_15 obj_11)
       (pred_10 obj_15 obj_12)
       (pred_10 obj_11 obj_20)
       (pred_10 obj_11 obj_15)
       (pred_10 obj_17 obj_02)
       (pred_10 obj_17 obj_05)
       (pred_10 obj_17 obj_14)
       (pred_10 obj_05 obj_03)
       (pred_10 obj_05 obj_19)
       (pred_10 obj_05 obj_12)
       (pred_10 obj_05 obj_17)
       (pred_10 obj_19 obj_18)
       (pred_10 obj_19 obj_20)
       (pred_10 obj_19 obj_15)
       (pred_10 obj_19 obj_05)
       (pred_10 obj_20 obj_21)
       (pred_10 obj_20 obj_11)
       (pred_10 obj_20 obj_19)
       (pred_10 obj_02 obj_08)
       (pred_10 obj_02 obj_03)
       (pred_10 obj_02 obj_17)
       (pred_10 obj_03 obj_04)
       (pred_10 obj_03 obj_18)
       (pred_10 obj_03 obj_05)
       (pred_10 obj_03 obj_02)
       (pred_10 obj_18 obj_22)
       (pred_10 obj_18 obj_21)
       (pred_10 obj_18 obj_19)
       (pred_10 obj_18 obj_03)
       (pred_10 obj_21 obj_10)
       (pred_10 obj_21 obj_20)
       (pred_10 obj_21 obj_18)
       (pred_10 obj_08 obj_04)
       (pred_10 obj_08 obj_02)
       (pred_10 obj_04 obj_22)
       (pred_10 obj_04 obj_03)
       (pred_10 obj_04 obj_08)
       (pred_10 obj_22 obj_10)
       (pred_10 obj_22 obj_18)
       (pred_10 obj_22 obj_04)
       (pred_10 obj_10 obj_21)
       (pred_10 obj_10 obj_22)
       (pred_11 obj_03)
       (pred_11 obj_02)
       (pred_11 obj_22)
       (pred_6  obj_03 obj_06)
       (pred_6  obj_02 obj_01)
       (pred_6  obj_22 obj_09)
       (pred_2 obj_14)
       (pred_2 obj_12)
       (pred_2 obj_15)
       (pred_2 obj_11)
       (pred_2 obj_17)
       (pred_2 obj_05)
       (pred_2 obj_19)
       (pred_2 obj_20)
       (pred_2 obj_18)
       (pred_2 obj_21)
       (pred_2 obj_08)
       (pred_2 obj_04)
       (pred_2 obj_10)

       (pred_4  obj_16 obj_06)
       (pred_4  obj_13 obj_01)
       (pred_4  obj_07 obj_09)
       (pred_1 obj_16 obj_10)
       (pred_1 obj_13 obj_14)
       (pred_1 obj_07 obj_12)
       (pred_9 obj_11)
    )

    (:goal (and
       (pred_1 obj_13 obj_12)
    ))
(:constraints
  (always (not (pred_9 obj_15)))
)
)

; plan
1. (op_2 obj_11 obj_20)
   deleted: (pred_9 obj_11)
   added: (pred_9 obj_20)
   goals met: 0 of 1
2. (op_2 obj_20 obj_19)
   deleted: (pred_9 obj_20)
   added: (pred_9 obj_19)
   goals met: 0 of 1
3. (op_2 obj_19 obj_05)
   deleted: (pred_9 obj_19)
   added: (pred_9 obj_05)
   goals met: 0 of 1
4. (op_2 obj_05 obj_12)
   deleted: (pred_9 obj_05)
   added: (pred_9 obj_12)
   goals met: 0 of 1
5. (op_2 obj_12 obj_14)
   deleted: (pred_9 obj_12)
   added: (pred_9 obj_14)
   goals met: 0 of 1
6. (op_3 obj_14 obj_13)
   deleted: (pred_1 obj_13 obj_14) (pred_7)
   added: (pred_8 obj_13)
   goals met: 0 of 1
7. (op_2 obj_14 obj_12)
   deleted: (pred_9 obj_14)
   added: (pred_9 obj_12)
   goals met: 0 of 1
8. (op_4 obj_12 obj_07 obj_13)
   deleted: (pred_8 obj_13) (pred_1 obj_07 obj_12)
   added: (pred_8 obj_07) (pred_1 obj_13 obj_12)
   goals met: 1 of 1
